from aiogram import types
from aiogram.dispatcher.filters import Command, Text
from aiogram.dispatcher import FSMContext

from loader import dp
from keyboards.default.zikrlar_dk import zk_m, toz, tuz

@dp.message_handler(text = "📿 Тонгги ва кечки зикрлар")
async def zikrlar_hands(msg: types.Message, state:FSMContext):
	await msg.answer("Тонги ва кечки зикрлар", reply_markup=zk_m)
	await state.set_state("zk_m")

# TONGI ZIKRLAR

@dp.message_handler(text = "🌅 Тонгги зикрлар", state="zk_m")
async def tongi_zikrlar_hands(msg:types.Message, state:FSMContext):
	await msg.answer("Тонги зикрлар", reply_markup=toz)
	await state.set_state("toz")
	
@dp.message_handler(text = "⏮ Oлдинги", state="toz")
async def zikrlarga_qaytish(msg: types.Message, state:FSMContext):
	await msg.answer("⏮ Oлдинги", reply_markup=zk_m)
	await state.set_state("zk_m")
	
@dp.message_handler(text = "1-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIGvGJAChiPeMSQ21gQHcvF6llPIqkLAAKrAgACa4JoSAPvMkPNMJrVIwQ",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ саллаллоҳу алайҳи васаллам: '
	                               '<b>\n"Ким тонг отган пайтда Oятал курсий ва Ғофир сурасининг '
	                               'аввалги икки ояти, "Ҳамим, танзийлул китааби миналлоҳил'
	                               ' ъазийзил ъалийм..."ни ўқиса, ўша кун то кеч киргунича '
	                               'уни муҳофаза қилинади. Ким кеч кирган пайтда ўқиса, '
	                               'то тонг отгунича уни ўша тунда муҳофаза қилинади</b>",'
	                               ' дедилар.\n\n<i>Имом Байҳақий ривояти.</i>')
	await msg.answer('بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيم\nِ'
	                 'اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما'
	                 ' فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ'
	                 ' إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ'
	                 ' وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ'
	                 ' السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ'
	                 '\n\n<b><i>Бисмиллаҳир роҳманир роҳийм. \nАллоҳу лаа илаҳа иллаҳув '
	                 'алҳайюл қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис '
	                 'самаваати ва маа фил арз. Ман заллазий яшфаъу ъиндаху иллаа биизниҳ. '
	                 'Яъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа юҳийтувна '
	                 'бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсийюҳус самаваати вал арз. '
	                 'Ва лаа яувдуҳу ҳифзуҳума ва ҳувал ъалийюйл ъазийм.</i></b>'
	                 '<i>\n\nМеҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. '
	                 '\nАллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. '
	                 'Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар '
	                 'Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас. '
	                 'У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. '
	                 'Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. '
	                 'Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. '
	                 'Ва У Алий ва Азим зотдир.</i>', reply_markup=toz)

@dp.message_handler(text = "2-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG32JACxLKbri9Vv2tj8TjPnjV2Fb7AAKuAwAC5KhxSI78xidlEtKTIwQ",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')
	await msg.answer('بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيم\nِ'
	                 'قُلْ هُوَ اللهُ أحَدٌ اللَّهُ الصَّمَدُ لَم يَلِد وَلَم يولَد وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ'
	                 '\n\n<b>Бисмиллаҳир роҳманир роҳийм. Қул ҳуваллоҳу аҳад. Аллоҳус сомад. '
	                 'Лам ялид ва лам ювлад. Валам якуллаҳу куфуван аҳад.</b>'
	                 '\n\n<b>Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.</b>'
	                 '\n<i>Айт: «У Аллоҳ ягонадир». Аллоҳ–сомаддир. У туғмаган ва туғилмаган.'
	                 ' Ва Унга ҳеч ким тенг бўлмаган.</i>', reply_markup=toz)

@dp.message_handler(text = "3-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG4WJACxev6wPA31MDyPInZS2LlfXgAAJjBAACroB4SG_-mwa6Vc73IwQ",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')

@dp.message_handler(text = "4-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG42JACx2OruYCxgECdLGxLoEdOAPTAAJaAwACS4qBSKyIguuLGuEFIwQ",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')

@dp.message_handler(text = "5-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG5WJACyF7mNDGu51QwG5QhCmL1_poAAJeAwAC_b-JSBRiHUxvRRFoIwQ",
	                       caption='Абу Молик Ашъарий розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '<b>\n«Сизлардан бирингиз тонг отганида</b>:\n\n'
	                               'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ للهِ رَبِّ العَالَمِينَ. اللهُمَّ أَسْأَلُكَ خَيْرَ هَذَا اليَوْمِ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ'
	                               ' وَهُدَاهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ'
	                               '\n\n<b>«Асбаҳнаа ва асбаҳал мулку лиллаҳи роббил ъаламийн. '
	                               'Аллоҳумма ас`алука хойра ҳазал йавми фатҳаҳу ва насроҳу ва нуроҳу ва'
	                               ' барокатаҳу ва ҳудаҳу ва аъузу бика мин шарри маа фийҳи ва шарри '
	                               'маа баъдаҳ», деб айтсин. Сўнгра кеч кирганида ҳам худди шундай десин»</b>,'
	                               ' дедилар. \n\n(<i>Маъноси: “Биз ҳам, мулк ҳам оламлар парвардигори '
	                               'Аллоҳники бўлган ҳолда тонг оттирдик. Эй Раббим, бу куннинг '
	                               'яхшисини, фатҳ бўлишини, ғалабасини, нурини, баракасини, '
	                               'ҳидоятини сўрайман. Ва Сендан бу куннинг ва бу кундан '
	                               'кейингисининг ёмонлигидан паноҳ тилайман”). '
	                               '\n\nАбу Довуд ривоятлари.</i>')

@dp.message_handler(text = "6-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG52JACycQgwhlwhJCuJiAbwxmvE3fAAJDBAACJ4qgSPgdAAFx8GiEHyME",
	                       caption='Шаддод ибн Авс розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: \n<b>«Ким саййидул '
	                               'истиғфор</b>:\n\n'
	                               'اللهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي، وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ'
	                               ' بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْت\n\nَ'
	                               '<b>«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана '
	                               'ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу '
	                               'бика мин шарри ма сонаъту, абу`у лака биниъматика ъалаййа ва '
	                               'абу`у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»</b>'
	                               ' <b>ни кечки пайт айтиб, тонг отгунича вафот этса, жаннатга киради. '
	                               'Ким тонгда айтиб, шу куни вафот этса, унда ҳам жаннатга киради», '
	                               'дедилар.</b>\n\n<i>Имом Бухорий ривоятлари.</i>')

@dp.message_handler(text = "7-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG6WJACyu2QAABC82sZe_AYIQRan3VlQACVwIAAiQlsUgilh2r41e4xSME",
	                       caption='Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: «Ким:\n\n'
	                               'رَضِيتُ بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً'
	                               '\n\n<b>«Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин '
	                               'соллаллоҳу алайҳи васаллама росула»</b>, деса, унга жаннат '
	                               'вожиб бўлади», дедилар.\n\n(<i>Маъноси: “Аллоҳни раббим деб, '
	                               'Исломни диним деб, Муҳаммад алайҳиссаломни расул деб рози бўлдим”).'
	                               '\n\nАбу Довуд ривоят қилганлар.</i>')

@dp.message_handler(text = "8-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG62JACy9mO9sy0HsSVTFnS-f4kzZSAAIXAwACC1S5SLbnzubXorb5IwQ",
	                       caption='Анас розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<i>«Ким тонг отганида ёки кеч кирганида</i>:\n\n'
	                               'اللهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أنْتَ الله'
	                               'ُ لاَ إلَهَ إلاَّ أنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ'
	                               '\n\n<b>«Аллоҳумма инний асбаҳту ушҳидука ва ушҳиду ҳамалата ъаршика ва '
	                               'малаикатика ва жамийъа холқик, аннака анталлоҳу лаа илаҳа илла анта '
	                               'ваҳдака лаа шарийка лака ва анна Муҳаммадан ъабдука ва росулук»</b>, '
	                               '<i>деб айтса, Аллоҳ таоло танасининг тўртдан бирини дўзахдан халос қилади. '
	                               'Ким шуни икки марта айтса, Аллоҳ таоло унинг ярмини дўзахдан халос '
	                               'қилади. Ким уч марта айтса, Аллоҳ таоло унинг тўртдан уч қисмини '
	                               'дўзахдан халос этади. Ким тўрт марта айтса, Аллоҳ таоло уни бутунлай '
	                               'дўзахдан халос қилади»</i>, дедилар.')
#
@dp.message_handler(text = "9-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG7WJACzOTHDq9rXpuXtU825Rfo6zeAALrAgACrKnISEH6pCrX5m32IwQ",
	                       caption='Абдуллоҳ ибн Ғанном розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: '
	                               '\n<i>«Ким тонг отганида:</i>\n\n'
	                               'اللهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ، فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ'
	                               '\n\n<b>«Аллоҳумма маа асбаҳа бий мин ниъматин фаминка ваҳдака лаа '
	                               'шарийка лак, фалакал ҳамду ва лакаш шукр»</b>, <i>деса, кундузнинг '
	                               'шукрини адо қилибди. Ким шу дуони кеч кирганида айтса, кечанинг '
	                               'шукрини адо этибди»</i>, дедилар.'
	                               '\n\n(<i>Маъноси: “Аллоҳим, мен билан тонг оттирган неъматлар Сен томондандир. '
	                               'Сен яккаю ёлғиздирсан, Сенинг шеригинг йўқ. Сенга ҳамд ва шукрлар бўлсин”).'
	                               '\n\nАбу Довуд ривоятлари.</i>')
#
@dp.message_handler(text = "10-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG72JACzeanhGZEwLa6aVld6CspPEiAAKMBAACMhLZSAPUaUemqbfoIwQ",
	                       caption='Абу Дардо розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<i>«Ким ҳар куни тонг отганида ва кеч кирганида:</i>\n\n'
	                               'حَسْبِيَ اللهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ'
	                               '\n\n<b>«Ҳасбийаллоҳу лаа илаҳа илла ҳува ъалайҳи таваккалту ва ҳува '
	                               'роббул ъаршил ъазийм»</b>. '
	                               '\n\n(<i>Маъноси: “Аллоҳ менга кифоя қилади. Ундан '
	                               'бошқа илоҳ йўқ. Унга таваккал қилдим. У улуғ аршнинг Раббидир),'
	                               ' деб етти марта айтса, унинг дунё ва охиратдаги муҳим ишларида '
	                               'Аллоҳнинг Ўзи кифоя қилади"</i>, дедилар.'
	                               '\n\n<i>Ибн Сунний ривоятлари.</i>')
#
@dp.message_handler(text = "11-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG8WJAC1FlbeE8p9wxM8V2JlrYbR9yAAJFAwAC7r7hSOA_bUPZoq7aIwQ",
	                       caption='Усмон ибн Аффон розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<b>«Бирор бир банда ҳар тонгда ва тунда:</b>\n\n'
	                               'بِاسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاء وَهُوَ السَّمِيعُ العَلِيمُ'
	                               '<b>\n\n«Бисмиллаҳиллазий лаа йазурру маъасмиҳи шай`ун фил арзи ва лаа фис '
	                               'самаи ва ҳувас самийъул ъалийм»</b>, <b>деб уч марта айтса, унга бирор '
	                               'нарса зарар бермайди»</b>, дедилар.'
	                               '\n\n(<i>Маъноси: “Шундай Аллоҳнинг исми билан бошлайманки, Унинг исми '
	                               'туфайли еру осмонда бирор нарса зарар бера олмайди. У эшитувчи ва '
	                               'билувчи Зотдир”).'
	                               '\n\nАбу Довуд ва Термизий ривоятлари.</i>')
#
@dp.message_handler(text = "12-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG82JAC1fzm9pKuwy90d0ZOirfkCwmAAJdAwACSbEBScon_bUkRhYmIwQ",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам тонг отганида:\n\n'
	                               'اللهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ'
	                               '<b>\n\n«Аллоҳумма бика асбаҳнаа ва бика амсайнаа ва бика '
	                               'наҳйаа ва бика намуту ва илайкан нушур»</b>'
	                               '\n\n(<i>Маъноси: “Аллоҳим, Сенинг номинг ила тонг оттирдик, Сенинг '
	                               'номинг ила кеч киргиздик. Сенинг номинг ила тириламиз ва '
	                               'Сенинг номинг ила ўламиз. Ва Сенга қайтажакмиз")</i>, дер эдилар.'
	                               '\n\n<i>Имом Термизий ривояти.</i>')

@dp.message_handler(text = "13-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG9WJAC1sLotGircbIQMLWDvcuVMFsAAIlAwACifYYSZ5y1rsGs5LFIwQ",
	                       caption='Абдуллоҳ ибн Абзо розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам қачон тонг оттирсалар\n\n:'
	                               'أصْبَحْنَا عَلَى فِطْرَةِ الإِسْلاَمِ وَكَلِمَةِ الإِخْلاَصِ وَدِينِ'
	                               ' مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَمِلَّةِ إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ '
	                               '<b>\n\n«Асбаҳна ъала фитратил Ислам ва калиматил ихласи ва дийни '
	                               'набиййина Муҳаммадин соллаллоҳу алайҳи васаллам ва миллати Иброҳийма'
	                               ' ҳанийфам муслиман ва маа ана минал мушрикийн»</b>, деб айтар эдилар.'
	                               '\n\n(<i>Маъноси: Мушрик бўлмасдан, мусулмон ҳолимизда ва тўғри йўлда бўлган '
	                               'Иброҳим алайҳиссаломнинг миллатларида, пайғамбаримиз Муҳаммад алайҳиссаломнинг'
	                               ' динларида, ихлос калимаси ва Ислом фитратида тонг оттирдик.)</i>'
	                               '\n\n<i>Ибн Сунний ривоятлари.</i>')

@dp.message_handler(text = "14-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG92JAC2DjPN1pxZcHde1xmHgWE4iJAAK-AwACDObwSHN-umyw9CkeIwQ",
	                       caption='Уммул мўминийн Жувайрия розияллоҳу анҳодан ривоят қилинади:'
	                               '\n<b>«Расулуллоҳ соллаллоҳу алайҳи васаллам эрталаб субҳ '
	                               'намози пайтида унинг ҳузуридан чиқиб кетдилар. '
	                               'У намоз ўқийдиган хонасида эди. Сўнгра зуҳо намозини ўқиб '
	                               'бўлиб қайтиб келсалар, Жувайрия онамиз ҳали ҳам ўтирган эдилар.'
	                               ' Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Чиқиб кетганимдан '
	                               'бери шу ҳолатда ўтирибсанми?» деб сўрадилар. Онамиз розияллоҳу '
	                               'анҳо: «Ҳа», дея жавоб бердилар. «Мен сендан кейин тўртта '
	                               'калимани уч мартадан айтдим, агар улар тарозида ўлчанса, сен '
	                               'бугун айтган нарсалардан оғир келади, – дедилар '
	                               'Расулуллоҳ соллаллоҳу алайҳи васаллам. – Улар:</b>\n\n'
	                               'سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَى نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ'
	                               '<b>\n\n«Субҳаналлоҳи ва биҳамдиҳи ъадада холқиҳи ва ризо нафсиҳи'
	                               ' ва зината ъаршиҳи ва мидаада калимаатиҳи»</b>.'
	                               '\n\n(<i>Маъноси: “Яратганларининг ададича, нафси рози бўлгунича, '
	                               'аршнинг вазнича, калималарнинг узунлигича Аллоҳга ҳамд айтаман ва Уни поклайман”).'
	                               '\n\nИмом Муслим ривоятлари.</i>')

@dp.message_handler(text = "15-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG-WJAC2WWdIGXKqHU_kwLTIjgHwOVAALEAwAC4wJwSdFnDNSmQCYEIwQ",
	                       caption='Абдураҳмон ибн Абу Бакра оталарига: «Эй отажон, ҳар тонгда уч марта '
	                               'ва кечқурун уч марта:\n\n'
	                               'اللهُمَّ عَافِنِي فِي بَدَنِي، اللهُمَّ عَافِنِي فِي سَمْعِي، اللهُمَّ عَافِنِي فِي بَصَرِي، لا إلَهَ إلاَّ أنْتَ. اللهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ لاَ إِلَهَ إِلاَّ أَنْتَ'
	                               '<b>\n\n«Аллоҳумма ъафиний фий баданий, Аллоҳумма ъафиний фий самъий, Аллоҳумма '
	                               'ъафиний фий басорий, лаа илаҳа илла анта. Аллоҳумма инний аъузу бика минал'
	                               ' куфри вал фақри, Аллоҳумма инний аъузу бика мин ъазабил қобр, лаа илаҳа '
	                               'илла анта»</b> деяётганингизни эшитаман», дедилар. Абу Бакра розияллоҳу анҳу: '
	                               '«Мен Расулуллоҳ соллаллоҳу алайҳи васалламнинг шундай дуо қилганларини эшитганман'
	                               ' ва мен у зотнинг суннатларига амал қилишни яхши кўраман», деб жавоб бердилар.'
	                               '\n\n(<i>Маъноси: “Аллоҳим, баданимни, қулоғимни ва кўзимни офиятда қил. Эй Раббим, '
	                               'Сенинг номинг ила куфрдан, камбағалликдан ва қабр азобидан паноҳ тилайман. '
	                               'Сендан бошқа илоҳ йўқ”).'
	                               '\n\nАбу Довуд ривоятлари.</i>')

@dp.message_handler(text = "16-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG-2JAC2lPeb6wcO4muHgG2nuuIFThAAIFAwACwFSZSTKuB846hG11IwQ",
	                       caption='Ибн Умар розияллоҳу анҳу айтадилар:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам қуйидаги дуоларни кеч '
	                               'кирганида ва тонг отганида ҳеч тарк қилмас эдилар:\n\n'
	                               'اللَّهُمَّ إنِّي اسْألُكَ العَافِيَةَ فِي'
	                               ' الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إنِّي اسْألُكَ العَفْوَ وَالعَافِيَةَ فِي دِيْنِي وَدُنْيَايَ وَأهْلِي'
	                               ' وَمَالِي، اللَّهُمَّ اسْتُرْ عَورَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ'
	                               ' خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوقِي وَأعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي'
	                               '\n\n<b>«Аллоҳумма инний ас`алукал ъафийата фиддунйа вал ахироҳ. '
	                               'Аллоҳумма инний ас`алукал ъафва вал ъафийата фий дийний ва дунйайа '
	                               'ва аҳлий ва маалий. Аллоҳуммастур ъавротий ва амин равъатий. '
	                               'Аллоҳуммаҳфазний мин байни йадаййа ва мин холфий ва ъан '
	                               'йамийний ва ъан шималий ва мин фавқий ва аъузу биъазоматика ан уғтаала мин '
	                               'таҳтий»</b>.')

@dp.message_handler(text = "17-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG_WJAC21HejmX5VfA5Om4pBH25ERfAAKVAwAC2-zQSf7_3tnoCCktIwQ",
	                       caption='Анас розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ алайҳиссалом Фотима розияллоҳу '
	                               'анҳога:\n<b>«Васият қилган нарсамни эшитишдан сени '
	                               'нима тўсади? Ҳар тонг ва кечқурун:\n\n</b>'
	                               'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ'
	                               ' أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ'
	                               '<b>\n\n«Йа ҳаййу йа қоййуму бироҳматика астағийсу аслиҳ '
	                               'лий ша`ний куллаҳу ва ла такилний ила нафсий торфата ъайн», '
	                               'деб айт»</b>, дедилар.'
	                               '\n\n(<i>Маъноси: “Эй ҳай-тирик ва қаййум сифатига эга бўлган Зот, '
	                               'Сендан ёрдам сўрайман. Шаънимни ҳар бир нарсада ислоҳ эт ва '
	                               'кўз юмиб очгунчалик муддат ҳам ўз ҳолимга ташлаб қўйма”).'
	                               '\n\nИбн Сунний ривоятлари.</i>')

@dp.message_handler(text = "18-зикр", state="toz")
async def tongi_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIG_2JAC3JajtYuR9Z982D2T_Xe3dw6AAJFAwAC7r7hSOA_bUPZoq7aIwQ",
	                       caption='Усмон ибн Аффон розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<b>«Бирор бир банда ҳар тонгда ва тунда:</b>\n\n'
	                               'بِاسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاء وَهُوَ السَّمِيعُ العَلِيمُ'
	                               '<b>\n\n«Бисмиллаҳиллазий лаа йазурру маъасмиҳи шай`ун фил арзи ва лаа фис самаи ва ҳувас самийъул ъалийм»</b>, деб уч марта айтса, унга бирор нарса '
	                               'зарар бермайди», дедилар.'
	                               '\n\n(<i>Маъноси: “Шундай Аллоҳнинг исми билан бошлайманки, Унинг исми туфайли '
	                               'еру осмонда бирор нарса зарар бера олмайди. У эшитувчи ва билувчи Зотдир”).'
	                               '\n\nАбу Довуд ва Термизий ривоятлари.</i>')

# KECHKI ZIKRLAR

@dp.message_handler(text = "🌄 Кечки зикрлар", state="zk_m")
async def kechki_zikrlar_hands(msg:types.Message, state:FSMContext):
	await msg.answer("Кечки зикрлар", reply_markup=tuz)
	await state.set_state("tuz")

@dp.message_handler(text = "⏮ Oлдинги", state="tuz")
async def zikrlarga_qaytish(msg: types.Message, state:FSMContext):
	await msg.answer("⏮ Oлдинги", reply_markup=zk_m)
	await state.set_state("zk_m")

@dp.message_handler(text = "1-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeI1jK8m3ldRHiPvD04x4mCiKYbRRoAACqwIAAmuCaEgD7zJDzTCa1SkE",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ саллаллоҳу алайҳи васаллам: '
	                               '<b>\n"Ким тонг отган пайтда Oятал курсий ва Ғофир сурасининг '
	                               'аввалги икки ояти, "Ҳамим, танзийлул китааби миналлоҳил'
	                               ' ъазийзил ъалийм..."ни ўқиса, ўша кун то кеч киргунича '
	                               'уни муҳофаза қилинади. Ким кеч кирган пайтда ўқиса, '
	                               'то тонг отгунича уни ўша тунда муҳофаза қилинади</b>",'
	                               ' дедилар.\n\n<i>Имом Байҳақий ривояти.</i>')
	await msg.answer('بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيم\nِ'
	                 'اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما'
	                 ' فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ'
	                 ' إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ'
	                 ' وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ'
	                 ' السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ'
	                 '\n\n<b>Бисмиллаҳир роҳманир роҳийм. \nАллоҳу лаа илаҳа иллаҳув '
	                 'алҳайюл қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис '
	                 'самаваати ва маа фил арз. Ман заллазий яшфаъу ъиндаху иллаа биизниҳ. '
	                 'Яъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа юҳийтувна '
	                 'бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсийюҳус самаваати вал арз. '
	                 'Ва лаа яувдуҳу ҳифзуҳума ва ҳувал ъалийюйл ъазийм.</b>'
	                 '<b>\n\nМеҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. '
	                 '\nАллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. '
	                 'Уни мудроқ ҳам,  уйқу ҳам олмас. Осмонлару ердаги нарсалар '
	                 'Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас. '
	                 'У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. '
	                 'Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. '
	                 'Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. '
	                 'Ва У Алий ва Азим зотдир.</b>', reply_markup=tuz)

@dp.message_handler(text = "2-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeI9jK8nvD8tKNwXm_6DEPBzntRVbAgACWgMAAkuKgUisiILrixrhBSkE",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')
	await msg.answer('بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيم\nِ'
	                 'قُلْ هُوَ اللهُ أحَدٌ اللَّهُ الصَّمَدُ لَم يَلِد وَلَم يولَد وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ'
	                 '\n\n<b>Бисмиллаҳир роҳманир роҳийм. Қул ҳуваллоҳу аҳад. Аллоҳус сомад. '
	                 'Лам ялид ва лам ювлад. Валам якуллаҳу куфуван аҳад.</b>'
	                 '\n\n<b>Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман.</b>'
	                 '\n<b>Айт: «У Аллоҳ ягонадир». Аллоҳ–сомаддир. У туғмаган ва туғилмаган.'
	                 ' Ва Унга ҳеч ким тенг бўлмаган.</b>')

@dp.message_handler(text = "3-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEGA7disFVnS1xz43mJHxUPPMT2G2XUOAACYwQAAq6AeEhv_psGulXO9ygE",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')

@dp.message_handler(text = "4-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAItK2Iwu1d7rqPfOqxNzLdIdBJMff6-AAJaAwACS4qBSDVOZ-VuUd2xIwQ",
	                       caption='Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам '
	                               'намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни '
	                               'топганимизда, <b>«Айт»</b>, дедилар. Мен ҳеч бир нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен ҳеч нарса айта олмадим. '
	                               'Сўнгра яна: <b>«Айт»</b>, дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» '
	                               'дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'قُلْ هُوَ اللهُ أحَدٌ... قُلْ أعُوذُ بِرَبِّ الفَلَقِ... قُلْ أعُوذُ بِرَبِّ النَّاسِ...'
	                               '<b>\n\n«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» '
	                               'сураларини кечки пайт ва эрталаб уч мартадан айтсанг, '
	                               'сенга ҳар бир нарсада кифоя қилади»</b>, дедилар».'
	                               '\n\n<i>Абу Довуд, Термизий ва Насаийлар ривояти.</i>')

@dp.message_handler(text = "5-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHWGJADcUIyhdk5NtD8DDzr2PWZdSJAAIDBAACpfaYSHCxqb1Z4oV_IwQ",
	                       caption='Абу Молик Ашъарий розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<b>«Сизлардан бирингиз кеч кирганида</b>:\n\n'
	                               'أمْسَينَا وَأَمْسَى الْمُلْكُ للهِ رَبِّ العَالَمِينَ.'
	                               ' اللهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيلَةِ، فَتْحَهَا وَنَصْرَهَا وَنُورَهَا'
	                               ' وَبَرَكَتَهَا وَهُدَاهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا، وَشَرِّ مَا بَعْدَهَا'
	                               '<b>\n\n«Амсайнаа ва амсал мулку лиллаҳи роббил ъаламийн. '
	                               'Аллоҳумма ас`алука хойра ҳазиҳил лайлати фатҳаҳаа ва '
	                               'насроҳаа ва нуроҳаа ва барокатаҳаа ва ҳудаҳаа ва аъузу '
	                               'бика мин шарри ма фийҳаа ва шарри маа баъдаҳаа»</b>, '
	                               'деб айтсин.'
	                               '\n\n(<i>Маъноси: “Биз ҳам, мулк ҳам оламлар парвардигори '
	                               'Аллоҳники бўлган ҳолда кеч киргиздик. Эй Раббим, бу '
	                               'кечанинг яхшисини, фатҳ бўлишини, ғалабасини, нурини, '
	                               'баракасини, ҳидоятини сўрайман. Ва Сендан бу кечанинг '
	                               'ва бу кечадан кейингисининг ёмонлигидан паноҳ тилайман”).'
	                               '\n\nАбу Довуд ривоятлари.</i>')

@dp.message_handler(text = "6-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeJhjK8o_qK8qlx1VLf1ALYOkz8ivhwACQwQAAieKoEj4HQABcfBohB8pBA",
	                       caption='Шаддод ибн Авс розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: \n<b>«Ким саййидул '
	                               'истиғфор</b>:\n\n'
	                               'اللهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي، وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ'
	                               ' بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْت\n\nَ'
	                               '<b>«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана '
	                               'ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу '
	                               'бика мин шарри ма сонаъту, абу`у лака биниъматика ъалаййа ва '
	                               'абу`у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»</b>'
	                               ' ни кечки пайт айтиб, тонг отгунича вафот этса, жаннатга киради. '
	                               'Ким тонгда айтиб, шу куни вафот этса, унда ҳам жаннатга киради», '
	                               'дедилар.\n\n<i>Имом Бухорий ривоятлари.</i>')

@dp.message_handler(text = "7-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeJpjK88ZCFqR-hwFzmS4JPt-6_LcNAACQAMAAmkGqEh2XgaVenmkzSkE",
	                       caption='Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: <b>«Ким</b>:\n\n'
	                               'رَضِيتُ بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً'
	                               '\n\n<b>«Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин '
	                               'соллаллоҳу алайҳи васаллама росула»</b>, деса, унга жаннат '
	                               'вожиб бўлади», дедилар.\n\n(<i>Маъноси: “Аллоҳни раббим деб, '
	                               'Исломни диним деб, Муҳаммад алайҳиссаломни расул деб рози бўлдим”).'
	                               '\n\nАбу Довуд ривоят қилганлар.</i>')

@dp.message_handler(text = "8-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHWmJADcrfGEPEWEc-iGFew5G_r-hzAALFAwACxmW5SEWMWgex5f1rIwQ",
	                       caption='اللهُمَّ مَا أَمْسَى بِي مِنْ نِعْمَةٍ'
	                               ' فَمِنْكَ وَحْدَكَ، لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ'
	                               '\n\n<b>«Аллоҳумма маа амсаа бий мин ниъматин фаминка ваҳдака лаа '
	                               'шарийка лак, фалакал ҳамду ва лакаш шукр»</b>'
	                               '\n\n(<i>Маъноси: “Аллоҳим, мен билан кеч киргизган неъматлар Сенинг '
	                               'якка Ўзинг томондандир. Сен яккаю ёлғиздирсан, Сенинг шеригинг йўқ.'
	                               ' Сенга ҳамд ва шукрлар бўлсин”)</i>')

@dp.message_handler(text = "9-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeKNjK89sM_BW9B2GMhPnPznrX3CsPwACYAQAAs1iyUiAStr1py-dRikE",
	                       caption='Абу Дардо розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам:'
	                               '\n<b>«Ким ҳар куни тонг отганида ва кеч кирганида:</b>\n\n'
	                               'حَسْبِيَ اللهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ'
	                               '\n\n<b>«Ҳасбийаллоҳу лаа илаҳа илла ҳува ъалайҳи таваккалту ва ҳува '
	                               'роббул ъаршил ъазийм»</b>. '
	                               '\n\n(<i>Маъноси: “Аллоҳ менга кифоя қилади. Ундан '
	                               'бошқа илоҳ йўқ. Унга таваккал қилдим. У улуғ аршнинг Раббидир),'
	                               ' деб етти марта айтса, унинг дунё ва охиратдаги муҳим ишларида '
	                               'Аллоҳнинг Ўзи кифоя қилади", дедилар.'
	                               '\n\nИбн Сунний ривоятлари.</i>')

@dp.message_handler(text = "10-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHYWJADeWO32OB5lwwfIvB31Nd4ZClAALtAwACfYHpSIWzXpU4R5wHIwQ",
	                       caption='<b>«Аллоҳумма бика амсайнаа ва бика асбаҳнаа '
	                               'ва бика наҳйаа ва бика намууту ва илайкал масийр»</b>'
	                               '\n\n(<i>Маъноси: “Аллоҳим, Сенинг номинг ила кеч киргиздик. '
	                               'Сенинг номинг тонг оттирдик ва Сенинг номинг ила '
	                               'тириламиз ва Сенинг номинг ила вафот этамиз. Ва Сенга қайтажакмиз”).'
	                               '\n\nАбу Довуд, Термизий ва Ибн Можалар ривояти.</i>')

@dp.message_handler(text = "11-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEGA7lisFW8c77ZhzTbvuNvT5_zeZu5QgACvgMAAgzm8EhzfrpssPQpHigE",
	                       caption='Уммул мўминийн Жувайрия розияллоҳу анҳодан ривоят қилинади:'
	                               '\n<b>«Расулуллоҳ соллаллоҳу алайҳи васаллам эрталаб субҳ '
	                               'намози пайтида унинг ҳузуридан чиқиб кетдилар. '
	                               'У намоз ўқийдиган хонасида эди. Сўнгра зуҳо намозини ўқиб '
	                               'бўлиб қайтиб келсалар, Жувайрия онамиз ҳали ҳам ўтирган эдилар.'
	                               ' Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Чиқиб кетганимдан '
	                               'бери шу ҳолатда ўтирибсанми?» деб сўрадилар. Онамиз розияллоҳу '
	                               'анҳо: «Ҳа», дея жавоб бердилар. «Мен сендан кейин тўртта '
	                               'калимани уч мартадан айтдим, агар улар тарозида ўлчанса, сен '
	                               'бугун айтган нарсалардан оғир келади, – дедилар '
	                               'Расулуллоҳ соллаллоҳу алайҳи васаллам. – Улар:</b>\n\n'
	                               'سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَى نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ'
	                               '<b>\n\n«Субҳаналлоҳи ва биҳамдиҳи ъадада холқиҳи ва ризо нафсиҳи'
	                               ' ва зината ъаршиҳи ва мидаада калимаатиҳи»</b>.'
	                               '\n\n(<i>Маъноси: “Яратганларининг ададича, нафси рози бўлгунича, '
	                               'аршнинг вазнича, калималарнинг узунлигича Аллоҳга ҳамд айтаман ва Уни поклайман”).'
	                               '\n\nИмом Муслим ривоятлари.</i>')

@dp.message_handler(text = "12-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeH1jK8gXJmd7Q17a4q3qvqhoYhcS1gACxAMAAuMCcEnRZwzUpkAmBCkE",
	                       caption='Абдураҳмон ибн Абу Бакра оталарига: «Эй отажон, ҳар тонгда уч марта '
	                               'ва кечқурун уч марта:\n\n'
	                               'اللهُمَّ عَافِنِي فِي بَدَنِي، اللهُمَّ عَافِنِي فِي سَمْعِي، اللهُمَّ عَافِنِي فِي بَصَرِي، لا إلَهَ إلاَّ أنْتَ. اللهُمَّ '
	                               ' إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ لاَ إِلَهَ إِلاَّ أَنْتَ'
	                               '<b>\n\n«Аллоҳумма ъафиний фий баданий, Аллоҳумма ъафиний фий самъий, Аллоҳумма '
	                               'ъафиний фий басорий, лаа илаҳа илла анта. Аллоҳумма инний аъузу бика минал'
	                               ' куфри вал фақри, Аллоҳумма инний аъузу бика мин ъазабил қобр, лаа илаҳа '
	                               'илла анта»</b> деяётганингизни эшитаман», дедилар. Абу Бакра розияллоҳу анҳу: '
	                               '«Мен Расулуллоҳ соллаллоҳу алайҳи васалламнинг шундай дуо қилганларини эшитганман'
	                               ' ва мен у зотнинг суннатларига амал қилишни яхши кўраман», деб жавоб бердилар.'
	                               '\n\n(<i>Маъноси: “Аллоҳим, баданимни, қулоғимни ва кўзимни офиятда қил. Эй Раббим, '
	                               'Сенинг номинг ила куфрдан, камбағалликдан ва қабр азобидан паноҳ тилайман. '
	                               'Сендан бошқа илоҳ йўқ”).'
	                               '\n\nАбу Довуд ривоятлари.</i>')

@dp.message_handler(text = "13-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAEMeLBjK8_HZbuKa16UNCTZleUFWkWWrwACBQMAAsBUmUkyrgfOOoRtdSkE",
	                       caption='Ибн Умар розияллоҳу анҳу айтадилар:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам қуйидаги дуоларни кеч '
	                               'кирганида ва тонг отганида ҳеч тарк қилмас эдилар:\n\n'
	                               'اللَّهُمَّ إنِّي اسْألُكَ العَافِيَةَ فِي'
	                               ' الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إنِّي اسْألُكَ العَفْوَ وَالعَافِيَةَ فِي دِيْنِي وَدُنْيَايَ وَأهْلِي'
	                               ' وَمَالِي، اللَّهُمَّ اسْتُرْ عَورَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ'
	                               ' خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوقِي وَأعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي'
	                               '\n\n<b>«Аллоҳумма инний ас`алукал ъафийата фиддунйа вал ахироҳ. '
	                               'Аллоҳумма инний ас`алукал ъафва вал ъафийата фий дийний ва дунйайа '
	                               'ва аҳлий ва маалий. Аллоҳуммастур ъавротий ва амин равъатий. '
	                               'Аллоҳуммаҳфазний мин байни йадаййа ва мин холфий ва ъан '
	                               'йамийний ва ъан шималий ва мин фавқий ва аъузу биъазоматика ан уғтаала мин '
	                               'таҳтий»</b>.')

@dp.message_handler(text = "14-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHbGJADkKP_kwOqmAfCugs8n95ndK1AAKRAgACmOwZSbJ2mG7ugCEAASME",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '<b>\nАбу Бакр Сиддиқ розияллоҳу анҳу: \n«Эй Расулуллоҳ, '
	                               'менга бирор калимани ўргатинг, уни тонг отганида ва '
	                               'кеч кирганда айтиб юрай», дедилар. Шунда у зот</b>:\n\n'
	                               'اللهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادَةِ  رَبَّ كُلِّ'
	                               ' شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ'
	                               ' الشَّيْطَانِ وَشِرْكِهِ وَأَنَّ نَقْتَرِفُ سُوءًا عَلَى أَنْفُسِنَا أَو نَجُرَّهُ إِلَى مُسْلِمٍ'
	                               '\n\n<b>«Аллоҳумма фатирос самавати вал арзи ъалимал ғойби '
	                               'ваш шаҳадати робба кулли шай`ин ва малийкаҳ, ашҳаду аллаа '
	                               'илаҳа илла анта, аъузу бика мин шарри нафсий ва шарриш '
	                               'шайтони ва ширкиҳи ва ан нақтарифа су`ан ъала анфусина '
	                               'ав нажурроҳу ила муслим», деб тонг отганида, '
	                               'кеч кирганида ва тўшагингизга ётганингизда айтиб юринг»</b>, '
	                               'дедилар.')
	await msg.answer('<i>Маъноси: Эй еру осмонни бор қилган Аллоҳим, эй ғоибни ва шоҳидни '
	                 'билувчи Раббим, Сен ҳар бир нарсанинг парвардигори ва подшоҳидирсан. '
	                 'Гувоҳлик бераманки, Сендан бошқа илоҳ йўқ. Нафсимнинг ёмонлигидан '
	                 'ва шайтоннинг ёмонлигию ҳийласидан Сенинг номинг ила паноҳ тилайман. '
	                 'Нафсимизга ёмонлик бўлишидан ва мусулмоннинг ҳам  ёмонликка '
	                 'гирифтор бўлишидан паноҳ тилаймиз.)'
	                 '\n\nАбу Довуд ва Термизий ривоятлари.</i>')

@dp.message_handler(text = "15-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHbmJADkjcEWrPPspqGAjal7jWVj_YAAIHAwACXNMoScfMkLHJQpFvIwQ",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузурларига бир киши келиб:'
	                               ' «Эй Расулуллоҳ, кеча мени чаён чақиб олди», деди. Шунда '
	                               'Набий соллаллоҳу алайҳи васаллам: <b>«Кеч кирганида:</b>\n\n'
	                               'أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ'
	                               '\n\n<b>«Аъузу бикалиматиллаҳит таммати мин шарри ма холақ», '
	                               'деб уч марта айтсанг, сенга ҳеч нарса зарар бермайди»</b>, дедилар.'
	                               '\n\n(<i>Маъноси: “Аллоҳнинг ҳамма калималари билан У яратган нарсаларнинг '
	                               'ёмонлигидан паноҳ тилайман”).\n\nИмом Муслим ва Аҳмад ривояти.</i>')

@dp.message_handler(text = "16-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHcGJADk_StQPKKj_Oy8xFrohWg_QpAAJEAwACHoIwSefHSCel3gF0IwQ",
	                       caption='Абу Дардо розияллоҳу анҳудан ривоят қилинади:'
	                               '\nНабий саллаллоҳу алайҳи васаллам:'
	                               '\n"<b>Ким менга тонг отганида ўнта ва кеч '
	                               'кирганида ўнта салавот айтса, Қиёмат куни '
	                               'шафоатимга эришади",</b> дедилар.'
	                               '\n\nИмом Табароний ривояти.اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وعَلَى آلِ مُحَمَّدٍ كَمَا'
	                               ' صَلَّيْتَ عَلَى إبْرَاهِيمَ وَعَلَى'
	                               ' آلِ إبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.'
	                               ' اللهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى'
	                               ' آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى'
	                               ' ابْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ'
	                               ' إِنَّكَ حَمِيدٌ مَجِيدٌ'
	                               '\n\n<b>«Аллоҳумма солли ъала Муҳаммадин ва ъала '
	                               'али Муҳаммад, кама соллайта ъала Иброҳийма ва ъала '
	                               'али Иброҳийм, иннака ҳамийдум мажийд. Аллоҳумма барик '
	                               'ъала Муҳаммадин ва ъала али Муҳаммад, кама барокта ъала '
	                               'Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд».</b>')
	await msg.answer("(<i>Маъноси: “Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини "
	                 "яхшилик ва раҳматда қилганинг каби, Муҳаммад алайҳиссаломни ва у "
	                 "зотнинг оилаларини ҳам яхшилик ва раҳматда қил. Албатта, "
	                 "Сен мақтовли улуғ зотсан. Аллоҳим, Иброҳим алайҳиссаломни ва у "
	                 "зотнинг оилаларини баракотли қилганингдек, Муҳаммад алайҳиссаломни "
	                 "ва у зотнинг оилаларини ҳам баракотли қил. Албатта, Сен мақтовли улуғ зотсан”).</i>")

@dp.message_handler(text = "17-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHcmJADlWwYgpZ677elIyclVfVxQVcAALuAgACHTdJSdqjs7yTpaEZIwQ",
	                       caption='Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам бир куни '
	                               'масжидга кирсалар, Абу Умома деган ансорий саҳоба ўтирган эдилар. '
	                               'Расулуллоҳ соллаллоҳу алайҳи васаллам: '
	                               '\n<b>«Эй Абу Умома, намоз вақтидан бошқа пайтда масжидда '
	                               'ўтирганинг боиси нима?»</b> деб сўрадилар. '
	                               '«Эй Расулуллоҳ, мени ғам ва қарз шу аҳволга солиб қўйди», '
	                               'дедилар. Шунда у зот: <b>«Сенга бир дуони ўргатайми? '
	                               'Уларни айтиб юрсанг, Аллоҳ ғамингни кетказиб, қарзингдан '
	                               'халос этади. Агар тонг отса ва кеч кирса</b>:\n\n'
	                               'اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالحَزَنِ وَأَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ '
	                               'وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ '
	                               '\n\n<b>«Аллоҳумма инний аъузу бика минал ҳамми вал ҳазани '
	                               'ва аъузу бика минал ъажзи вал касали ва аъузу бика минал '
	                               'жубни вал бухли ва аъузу бика мин ғолабатид дайни ва қоҳрир рижал» ни айт»</b>')
	await msg.answer('(Аллоҳим, Сенинг номинг ила ғам-ташвишдан, ожизлик ва дангасаликдан, '
	                 'қўрқоқлик ва бахилликдан, қарз эзиб қўйиши ва кишиларнинг қаҳридан '
	                 'паноҳ тилайман), деб буюрдилар. '
	                 'Абу Умома: «Сўнг Набий соллаллоҳу алайҳи васалламнинг айтганларига амал қилдим. '
	                 'Аллоҳ менинг ғам-ғуссамни кетказиб, қарздан халос этди», деб айтадилар».'
	                 '\n\n<i>Абу Довуд ривоятлари.</i>')

@dp.message_handler(text = "18-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHdGJADl6DCPq9rGS7yEPGXHcR_XCTAAIlAwACUadZSfjoXqbLFk9CIwQ",
	                       caption='Анас розияллоҳу анҳудан ривоят қилинади:'
	                               '\nНабий соллаллоҳу алайҳи васаллам:'
	                               '\n<b>«Ким жума куни бомдод намозидан олдин:</b>\n\n'
	                               'أسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ'
	                               '\n\n<b>«Астағфируллоҳаллазий лаа илаҳа илла ҳувал '
	                               'ҳаййул қоййум ва атубу илайҳ», деб уч марта айтса, '
	                               'Аллоҳ таоло унинг гуноҳларини денгиз кўпигича бўлса ҳам, '
	                               'кечириб юборади»</b>, дедилар.'
	                               '\n\n(<i>Маъноси: Ҳай ва қаййум сифатли Зотдан бошқа илоҳ йўқ '
	                               'ва Унга истиғфор айтаман, Унга тавба қиламан.)'
	                               '\n\nИбн Сунний ривоятлари.</i>')

@dp.message_handler(text = "19-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHdmJADmRYf8dY0UdyRy23nimskia1AAJOAwACtC55Sbbc1CxZRcZeIwQ",
	                       caption='Абу Айюб Ансорий розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам: <b>«Ким:</b>\n\n'
	                               'لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ'
	                               '\n\n<b>«Лаа илаҳа иллаллоҳу ваҳдаҳу лаа шарийка лаҳу, лаҳул мулку ва '
	                               'лаҳул ҳамду ва ҳува ъалаа кулли шай`ин қодийр», деб ўн марта айтса, '
	                               'Исмоил зурриётидан тўрт кишини озод қилгандек бўлади»</b>, дедилар».'
	                               '\n\n(<i>Маъноси: “Аллоҳдан бошқа илоҳ йўқ, У ёлғиз, Унинг шериги ҳам йўқ, '
	                               'бутун мулк Уники, ҳамд ҳам Унга хос ва У ҳар бир нарсага қодирдир”).'
	                               '\n\nИмом Бухорий ва Муслим ривоятлари.</i>')

@dp.message_handler(text = "20-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHeGJADmolLAosNZtRbamQr56piR5mAAIkAwACtC6JSSQanlDZxloAASME",
	                       caption='Толқ ибн Ҳабибдан ривоят қилинади:'
	                               '\n«Бир киши Абу Дардо розияллоҳу анҳунинг '
	                               'олдларига келиб: «Эй Абу Дардо, уйингиз ёниб кетди», '
	                               'деди. Абу Дардо эса: «Аллоҳ азза ва жалла бундай '
	                               'қилиши мумкин эмас. Чунки мен Расулуллоҳ соллаллоҳу '
	                               'алайҳи васалламдан бир нечта калимани эшитганман. '
	                               'Ким уларни кундузи айтса, кеч киргунича унга бирор мусибат етмайди. '
	                               'Ким уларни кечки пайт айтса, тонг отгунича унга бирор мусибат '
	                               'етмайди, деганлар. У дуо  қуйидагича:\n\n'
	                               'اللهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ'
	                               ' أَنْتَ عَلَيْكَ تَوَكَّلْتُ وَأَنْتَ رَبُّ العَرْشِ العَظِيمِ، مَا شَاءَ اللهُ كَانَ وَمَا'
	                               ' لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللهَ'
	                               ' أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا. اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ'
	                               ' شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ')
	await msg.answer('<b>«Аллоҳумма анта роббий, лаа илаҳа илла анта ъалайка таваккалту '
	                 'ва анта роббул ъаршил ъазийм. Маша`аллоҳу каана ва маа лам йаша` '
	                 'лам якун. Аъламу анналлоҳа ъала кулли шай`ин қодийр ва анналлоҳа қод аҳато '
	                 'бикулли шай`ин ъилма. Аллоҳумма инний аъузу бика мин шарри нафсий '
	                 'ва мин шарри кулли даббатин анта aхизун бинaсийатиҳа, инна роббий '
	                 'ъала сиротим мустақийм».</b>'
	                 '\n\n(<i>Маъноси: Аллоҳим, Сен парвардигоримсан. Сендан бошқа илоҳ йўқ. '
	                 'Сенга таваккал қилдим. Сен улуғ арш Раббидирсан. Сен хоҳлаган нарса бўлади, '
	                 'хоҳламаганинг бўлмайди. Улуғ ва олий Аллоҳдан бошқада ўзгартириш ва қувват йўқ.'
	                 ' Албатта, Аллоҳ ҳар бир нарсага қодир эканини биламан. Албатта, Аллоҳ ҳар '
	                 'бир нарсани илми билан иҳота қилгандир. Эй Раббим, нафсимнинг ёмонлигидан '
	                 'ва пешонасидан тутадиганинг ҳар бир ҳайвоннинг ёмонлигидан Сенинг номинг '
	                 'ила паноҳ тилайман. Албатта, эй Раббим, Сенинг йўлинг тўғри йўлдир.)'
	                 '\n\nИбн Сунний ривоятлари.</i>')

@dp.message_handler(text = "21-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHemJADnHrqeQIhcMBE3hyUY95fHxHAAKzBAACpvioSR6SgRr7TIScIwQ",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам: <b>«Ким эрталаб ёки кечқурун</b>:'
	                               'سُبْحَانَ اللهِ وَبِحَمْدِهِ'
	                               'سُبْحَانَ اللهِ وَبِحَمْدِهِ سُبْحَانَ اللهِ العَظِيمِ'
	                               '\n\n<b>«Субҳаналлоҳи ва биҳамдиҳи», (Аллоҳга ҳамд айтиш билан Уни айбу '
	                               'нуқсонлардан поклаб ёд этаман) ёки «Субҳаналлоҳи ва биҳамдиҳи '
	                               'субҳоналлоҳил ъазийм», деб юз марта айтса, қиёмат куни бирор киши '
	                               'ундан афзал бўлмайди. Фақат ана шу киши айтганидек ёки ундан ошириб '
	                               'айтсагина, бўлиши мумкин»</b>, дедилар.'
	                               '\n\n<i>Имом Муслим ривоятлари.</i>')

@dp.message_handler(text = "22-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHfGJADne-XpaHpzag7biyyn7Phf_YAAMDAALpksBJYRS_TWU6w20jBA",
	                       caption='Умму Салама онамиз розияллоҳу анҳодан ривоят қилинади:'
	                               '\nРасулуллоҳ соллаллоҳу алайҳи васаллам тонг отса:\n\n'
	                               'اللَّهُمَّ إنِّي اسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً'
	                               '\n\n<b>«Аллоҳумма инний ас`алука ъилман нафиъан ва ризқон '
	                               'тоййибан ва ъамалан мутақоббала»</b>, деб айтар эдилар.'
	                               '\n\n(<i>Маъноси: “Аллоҳим, Сендан фойдали илм, покиза ризқ,'
	                               ' қабул бўладиган амал сўрайман”).'
	                               '\n\nИбн Можа ва Ибн Сунний ривоятлари.</i>')

@dp.message_handler(text = "23-зикp", state="tuz")
async def kechki_zikr_hands(msg: types.Message):
	await msg.answer_audio(audio="CQACAgIAAxkBAAIHfmJADn_PPMqK_5pOrB2BvEuDeh4vAAKJAwACIcLQSTYTVhqlL0BHIwQ",
	                       caption='Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:'
	                               '\n«Расулуллоҳ соллаллоҳу алайҳи васаллам:\n\n'
	                               'سُبْحَانَ اللهِ وَالْحَمْدُ للهِ وَلاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ'
	                               '\n\n<b>«Субҳаналлоҳи валҳамду лиллаҳи ва ла илаҳа '
	                               'иллаллоҳу валлоҳу  акбар», дейишим мен учун қуёш чиқиб,'
	                               ' нур сочганидан яхшироқдир»</b>, дедилар».'
	                               '\n\n<i>Имом Муслим ривоятлари.</i>')
