from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

h_dkdict = ["Анoнс","Шоҳи Зинда","Ҳидоят имоми","Юртимизда илк намоз ўқиган киши","Мовароуннаҳрга ислом келиши тарихи",
			"Қусам ибн Аббос розияллоҳу анҳунинг зиёратлари","Чиллахона","Регистон мажмуаси","Мақбаралар","Мирзо Улуғбек мадрасаси",
			"Мирзо Улуғбек мадрасасида таълим","Мирзо Улуғбек расадхонаси","Амир Темур мақбараси","Шердор мадрасаси","Хўжа Аҳрор Валий зиёратгоҳи",
			"Имом Бухорий тадқиқот маркази","Баҳоуддин Нақшбандий","Сайид Амир Кулол ва Чор Бакр мажмуалари","Имом Абу Ҳафс Кабир мақбараси",
			"Сайфиддин Боҳарзий мақбараси","Бухоро арки","Абдуллоҳ Яманий","Масжиди Калон","Шайх Алоуддин мақбараси",
			"Паҳлавон Маҳмуд мақбараси","Жума масжиди","Карвонсарой","Муҳаммад Аминхон мадрасаси","Тошҳовли",
			"Қутлуғ Мурод Иноқ мадрасаси","Оллоқулихон мадрасаси","Огаҳий уй музейи","Кўҳна арк","Нуриллоҳбой саройи",
			"Исломхўжа меъморий ансамбли"]

h_dklist = list(range(72,107))

h_empty = {}

for i in range(0,len(h_dkdict)):
	h_empty[h_dkdict[i]] = h_dklist[i]

h1 = ReplyKeyboardMarkup(row_width=2,
						 resize_keyboard=True,
						 one_time_keyboard=True)
h = h_dkdict
h1.add("🏡 Бош меню")
h1.add(h[0])
for n in h:
	if n == h[0]:
		pass
	else:
		h1.insert(n)